# Import the libraries and reading the data

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [4]:
data = pd.read_csv('/content/drive/My Drive/Materi Data MBA/transactions.csv')
data['transactionAmount'] = pd.to_numeric(data['transactionAmount'],errors='coerce')
data['availableMoney'] = pd.to_numeric(data['availableMoney'],errors='coerce')
data['currentBalance'] = pd.to_numeric(data['currentBalance'],errors='coerce')

In [5]:
data.head()

   accountNumber  customerId  ...  cardPresent  expirationDateKeyInMatch
0      733493772   733493772  ...        False                     False
1      733493772   733493772  ...        False                     False
2      733493772   733493772  ...        False                     False
3      733493772   733493772  ...        False                     False
4      733493772   733493772  ...        False                     False

[5 rows x 23 columns]

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 23 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   accountNumber             641914 non-null  int64
 1   customerId                641914 non-null  int64
 2   creditLimit               641914 non-null  int64
 3   availableMoney            641914 non-null  float64
 4   transactionDateTime       641914 non-null  object
 5   transactionAmount         641914 non-null  float64
 6   merchantName              641914 non-null  object
 7   acqCountry                638001 non-null  object
 8   merchantCountryCode       641290 non-null  object
 9   posEntryMode              638569 non-null  float64
 10  posConditionCode          641627 non-null  float64
 11  merchantCategoryCode      641914 non-null  object
 12  currentExpDate            641914 non-null  object
 13  accountOpenDate           641914 non-null  object
 14  dateOfLastAddressChange   641914 non-null  object
 15  cardCVV                   641914 non-null  int64
 16  enteredCVV                641914 non-null  int64
 17  cardLast4Digits           641914 non-null  int64
 18  transactionType           641325 non-null  object
 19  isFraud                   641914 non-null  bool
 20  currentBalance            641914 non-null  float64
 21  cardPresent               641914 non-null  bool
 22  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(5), int64(6), object(9)
memory usage: 99.8+ MB

# Data Selection

In [ ]:
data[['accountNumber','customerId','creditLimit']].head()

   accountNumber  customerId  creditLimit
0      733493772   733493772         5000
1      733493772   733493772         5000
2      733493772   733493772         5000
3      733493772   733493772         5000
4      733493772   733493772         5000

In [ ]:
data.iloc[:,1:4].head()

   accountNumber  customerId  creditLimit
0      733493772   733493772         5000
1      733493772   733493772         5000
2      733493772   733493772         5000
3      733493772   733493772         5000
4      733493772   733493772         5000

In [ ]:
data.iloc[0]

transaction_id                          5533441
accountNumber                         733493772
customerId                            733493772
creditLimit                                5000
availableMoney                             5000
transactionDateTime         2016-01-08T19:04:50
transactionAmount                        111.33
merchantName                               Lyft
acqCountry                                   US
merchantCountryCode                          US
posEntryMode                                  5
posConditionCode                              1
merchantCategoryCode                  rideshare
currentExpDate                       01/04/2020
accountOpenDate                      03/08/2014
dateOfLastAddressChange              03/08/2014
cardCVV                                     492
enteredCVV                                  492
cardLast4Digits                            9184
transactionType                        PURCHASE
isFraud                                    True
echoBuffer                                  NaN
currentBalance                                0
merchantCity                                NaN
merchantState                               NaN
merchantZip                                 NaN
cardPresent                               False
posOnPremises                               NaN
recurringAuthInd                            NaN
expirationDateKeyInMatch                  False
Name: 0, dtype: object

In [ ]:
data.iloc[:2,:5]

   transaction_id  accountNumber  customerId  creditLimit  availableMoney
0         5533441      733493772   733493772         5000         5000.00
1         5533442      733493772   733493772         5000         4888.67

In [ ]:
data.loc[0,['transaction_id','accountNumber','customerId','creditLimit','availableMoney']]

transaction_id      5533441
accountNumber     733493772
customerId        733493772
creditLimit            5000
availableMoney         5000
Name: 0, dtype: object

In [ ]:
data.iloc[0,0:5]

transaction_id      5533441
accountNumber     733493772
customerId        733493772
creditLimit            5000
availableMoney         5000
Name: 0, dtype: object

# Data Filtering

In [ ]:
data.head()
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 30 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  echoBuffer                0 non-null       float64
 22  currentBalance            641794 non-null  float64
 23  merchantCity              0 non-null       float64
 24  merchantState             0 non-null       float64
 25  merchantZip               0 non-null       float64
 26  cardPresent               641914 non-null  bool
 27  posOnPremises             0 non-null       float64
 28  recurringAuthInd          0 non-null       float64
 29  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(11), int64(7), object(9)
memory usage: 134.1+ MB

In [ ]:
len(data[(data['posEntryMode']==5.0)&data['isFraud']==True])

2080

In [ ]:
len(data[(data['posEntryMode']==9.0)&data['isFraud']==True])

5387

In [ ]:
data.posEntryMode.value_counts()

5.0     255615
9.0     193193
2.0     160589
90.0     16251
80.0     12921
Name: posEntryMode, dtype: int64

# Data Addition

In [ ]:
df = data.head()
df = df.iloc[:,:8]

In [ ]:
df

   transaction_id  accountNumber  ...  transactionAmount  merchantName
0         5533441      733493772  ...             111.33          Lyft
1         5533442      733493772  ...              24.75          Uber
2         5533443      733493772  ...             187.40          Lyft
3         5533444      733493772  ...             227.34          Lyft
4         5533445      733493772  ...               0.00          Lyft

[5 rows x 8 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   transaction_id       5 non-null      int64
 1   accountNumber        5 non-null      int64
 2   customerId           5 non-null      int64
 3   creditLimit          5 non-null      int64
 4   availableMoney       5 non-null      float64
 5   transactionDateTime  5 non-null      object
 6   transactionAmount    5 non-null      float64
 7   merchantName         5 non-null      object
dtypes: float64(2), int64(4), object(2)
memory usage: 448.0+ bytes

In [ ]:
df['transactionDateTime'] = pd.to_datetime(df['transactionDateTime'], format="%Y-%m-%dT%H:%M:%S")

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   transaction_id       5 non-null      int64
 1   accountNumber        5 non-null      int64
 2   customerId           5 non-null      int64
 3   creditLimit          5 non-null      int64
 4   availableMoney       5 non-null      float64
 5   transactionDateTime  5 non-null      datetime64[ns]
 6   transactionAmount    5 non-null      float64
 7   merchantName         5 non-null      object
dtypes: datetime64[ns](1), float64(2), int64(4), object(1)
memory usage: 448.0+ bytes

In [ ]:
df['transactionHour'] = df['transactionDateTime'].dt.hour
df.head()

   transaction_id  accountNumber  ...  merchantName  transactionHour
0         5533441      733493772  ...          Lyft               19
1         5533442      733493772  ...          Uber               22
2         5533443      733493772  ...          Lyft               13
3         5533444      733493772  ...          Lyft               22
4         5533445      733493772  ...          Lyft                1

[5 rows x 9 columns]

In [ ]:
df.head()

   transaction_id  accountNumber  ...  merchantName  transactionHour
0         5533441      733493772  ...          Lyft               19
1         5533442      733493772  ...          Uber               22
2         5533443      733493772  ...          Lyft               13
3         5533444      733493772  ...          Lyft               22
4         5533445      733493772  ...          Lyft                1

[5 rows x 9 columns]

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']})
result = pd.concat([df1,df2],ignore_index = True)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

# Data Deletion

In [ ]:
df.drop('transactionDateTime',axis = 1,inplace = True)
df

   transaction_id  accountNumber  ...  merchantName  transactionHour
0         5533441      733493772  ...          Lyft               19
1         5533442      733493772  ...          Uber               22
2         5533443      733493772  ...          Lyft               13
3         5533444      733493772  ...          Lyft               22
4         5533445      733493772  ...          Lyft                1

[5 rows x 8 columns]

In [ ]:
df.drop([0,1,2],axis = 0, inplace = True)

In [ ]:
df

   transaction_id  accountNumber  ...  merchantName  transactionHour
3         5533444      733493772  ...          Lyft               22
4         5533445      733493772  ...          Lyft                1

[2 rows x 8 columns]

# Data Rename

In [ ]:
df.rename(columns={'accountNumber':'AccNo','customerId':'custId'},inplace = True)
df

   transaction_id      AccNo  ...  merchantName  transactionHour
3         5533444  733493772  ...          Lyft               22
4         5533445  733493772  ...          Lyft                1

[2 rows x 8 columns]

In [ ]:
df.rename(columns=str.lower,inplace = True)
df

   transaction_id      accno  ...  merchantname  transactionhour
3         5533444  733493772  ...          Lyft               22
4         5533445  733493772  ...          Lyft                1

[2 rows x 8 columns]

# Data Sorting

In [ ]:
df = data.head()
df = df.iloc[:,:8]
df

   transaction_id  accountNumber  ...  transactionAmount  merchantName
0         5533441      733493772  ...             111.33          Lyft
1         5533442      733493772  ...              24.75          Uber
2         5533443      733493772  ...             187.40          Lyft
3         5533444      733493772  ...             227.34          Lyft
4         5533445      733493772  ...               0.00          Lyft

[5 rows x 8 columns]

In [ ]:
df.sort_values('availableMoney',ascending = True)

   transaction_id  accountNumber  ...  transactionAmount  merchantName
4         5533445      733493772  ...               0.00          Lyft
3         5533444      733493772  ...             227.34          Lyft
2         5533443      733493772  ...             187.40          Lyft
1         5533442      733493772  ...              24.75          Uber
0         5533441      733493772  ...             111.33          Lyft

[5 rows x 8 columns]

In [ ]:
df.sort_values(['availableMoney', 'transactionAmount'], ascending=[True, True])

   transaction_id  accountNumber  ...  transactionAmount  merchantName
4         5533445      733493772  ...               0.00          Lyft
3         5533444      733493772  ...             227.34          Lyft
2         5533443      733493772  ...             187.40          Lyft
1         5533442      733493772  ...              24.75          Uber
0         5533441      733493772  ...             111.33          Lyft

[5 rows x 8 columns]

# Pandas Functionality

In [ ]:
data.head(7)

   transaction_id  accountNumber  ...  recurringAuthInd  expirationDateKeyInMatch
0         5533441      733493772  ...               NaN                     False
1         5533442      733493772  ...               NaN                     False
2         5533443      733493772  ...               NaN                     False
3         5533444      733493772  ...               NaN                     False
4         5533445      733493772  ...               NaN                     False
5         5533446      733493772  ...               NaN                     False
6         5533447      733493772  ...               NaN                     False

[7 rows x 30 columns]

In [ ]:
data.tail(5)

        transaction_id  ...  expirationDateKeyInMatch
641909         6175350  ...                     False
641910         6175351  ...                     False
641911         6175352  ...                     False
641912         6175353  ...                     False
641913         6175354  ...                     False

[5 rows x 30 columns]

In [ ]:
data.shape

(641914, 30)

In [ ]:
data.columns

Index(['transaction_id', 'accountNumber', 'customerId', 'creditLimit',
       'availableMoney', 'transactionDateTime', 'transactionAmount',
       'merchantName', 'acqCountry', 'merchantCountryCode', 'posEntryMode',
       'posConditionCode', 'merchantCategoryCode', 'currentExpDate',
       'accountOpenDate', 'dateOfLastAddressChange', 'cardCVV', 'enteredCVV',
       'cardLast4Digits', 'transactionType', 'isFraud', 'echoBuffer',
       'currentBalance', 'merchantCity', 'merchantState', 'merchantZip',
       'cardPresent', 'posOnPremises', 'recurringAuthInd',
       'expirationDateKeyInMatch'],
      dtype='object')

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 30 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  echoBuffer                0 non-null       float64
 22  currentBalance            641794 non-null  float64
 23  merchantCity              0 non-null       float64
 24  merchantState             0 non-null       float64
 25  merchantZip               0 non-null       float64
 26  cardPresent               641914 non-null  bool
 27  posOnPremises             0 non-null       float64
 28  recurringAuthInd          0 non-null       float64
 29  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(11), int64(7), object(9)
memory usage: 134.1+ MB

In [ ]:
data.describe()

       transaction_id  accountNumber  ...  posOnPremises  recurringAuthInd
count    6.419140e+05   6.419140e+05  ...            0.0               0.0
mean     5.854398e+06   5.547701e+08  ...            NaN               NaN
std      1.853048e+05   2.546884e+08  ...            NaN               NaN
min      5.533441e+06   1.005471e+08  ...            NaN               NaN
25%      5.693919e+06   3.223192e+08  ...            NaN               NaN
50%      5.854398e+06   5.438879e+08  ...            NaN               NaN
75%      6.014876e+06   7.862277e+08  ...            NaN               NaN
max      6.175354e+06   9.999853e+08  ...            NaN               NaN

[8 rows x 18 columns]

In [ ]:
data.creditLimit.mean()

10697.210607651492

In [ ]:
data.creditLimit.mode()[0]

5000

In [ ]:
data.creditLimit.median()

7500.0

In [ ]:
data.creditLimit.max()

50000

In [ ]:
data.creditLimit.min()

250

In [ ]:
data.isnull().sum()

transaction_id                   0
accountNumber                    0
customerId                       0
creditLimit                      0
availableMoney                 279
transactionDateTime              0
transactionAmount             1816
merchantName                     0
acqCountry                    3913
merchantCountryCode            624
posEntryMode                  3345
posConditionCode               287
merchantCategoryCode             0
currentExpDate                   0
accountOpenDate                  0
dateOfLastAddressChange          0
cardCVV                          0
enteredCVV                       0
cardLast4Digits                  0
transactionType                589
isFraud                          0
echoBuffer                  641914
currentBalance                 120
merchantCity                641914
merchantState               641914
merchantZip                 641914
cardPresent                      0
posOnPremises               641914
recurringAuthInd            641914
expirationDateKeyInMatch         0
dtype: int64

In [ ]:
data.notnull().sum()

transaction_id              641914
accountNumber               641914
customerId                  641914
creditLimit                 641914
availableMoney              641635
transactionDateTime         641914
transactionAmount           640098
merchantName                641914
acqCountry                  638001
merchantCountryCode         641290
posEntryMode                638569
posConditionCode            641627
merchantCategoryCode        641914
currentExpDate              641914
accountOpenDate             641914
dateOfLastAddressChange     641914
cardCVV                     641914
enteredCVV                  641914
cardLast4Digits             641914
transactionType             641325
isFraud                     641914
echoBuffer                       0
currentBalance              641794
merchantCity                     0
merchantState                    0
merchantZip                      0
cardPresent                 641914
posOnPremises                    0
recurringAuthInd                 0
expirationDateKeyInMatch    641914
dtype: int64

In [ ]:
data.dropna(axis = 1,inplace = True)
data.isnull().sum()

transaction_id              0
accountNumber               0
customerId                  0
creditLimit                 0
transactionDateTime         0
merchantName                0
merchantCategoryCode        0
currentExpDate              0
accountOpenDate             0
dateOfLastAddressChange     0
cardCVV                     0
enteredCVV                  0
cardLast4Digits             0
isFraud                     0
cardPresent                 0
expirationDateKeyInMatch    0
dtype: int64

In [ ]:
data.isnull().sum()

transaction_id              0
accountNumber               0
customerId                  0
creditLimit                 0
transactionDateTime         0
merchantName                0
merchantCategoryCode        0
currentExpDate              0
accountOpenDate             0
dateOfLastAddressChange     0
cardCVV                     0
enteredCVV                  0
cardLast4Digits             0
isFraud                     0
cardPresent                 0
expirationDateKeyInMatch    0
dtype: int64

In [ ]:
data.fillna(axis = 1, value = -1, inplace = True)
data.isnull().sum()

transaction_id              0
accountNumber               0
customerId                  0
creditLimit                 0
transactionDateTime         0
merchantName                0
merchantCategoryCode        0
currentExpDate              0
accountOpenDate             0
dateOfLastAddressChange     0
cardCVV                     0
enteredCVV                  0
cardLast4Digits             0
isFraud                     0
cardPresent                 0
expirationDateKeyInMatch    0
dtype: int64

In [ ]:
data = pd.read_csv('transactions1.csv',low_memory = False)

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 24 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641914 non-null  object
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         641914 non-null  object
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  currentBalance            641914 non-null  object
 22  cardPresent               641914 non-null  bool
 23  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(2), int64(7), object(12)
memory usage: 104.7+ MB

In [ ]:
data['merchantCategoryCode'].unique()

array(['rideshare', 'online_gifts', 'personal care', 'fastfood',
       'entertainment', 'online_subscriptions', 'mobileapps', 'fuel',
       'food', 'online_retail', 'airline', 'hotels', 'food_delivery',
       'cable/phone', 'subscriptions', 'auto', 'gym', 'furniture',
       'health'], dtype=object)

In [ ]:
data['merchantCategoryCode'].value_counts()

online_retail           161469
fastfood                101196
entertainment            69138
food                     68245
rideshare                50574
online_gifts             33045
hotels                   22879
fuel                     22566
subscriptions            18376
personal care            16917
mobileapps               14614
health                   14344
online_subscriptions     11247
auto                     10147
airline                   9990
furniture                 7813
food_delivery             4990
gym                       2874
cable/phone               1490
Name: merchantCategoryCode, dtype: int64

## Advanced Data Manipulation in Python ##

In [ ]:
data = pd.read_csv('transactions1.csv',low_memory = False)
data['transactionAmount'] = pd.to_numeric(data['transactionAmount'],errors='coerce')
data['availableMoney'] = pd.to_numeric(data['availableMoney'],errors='coerce')
data['currentBalance'] = pd.to_numeric(data['currentBalance'],errors='coerce')
data.head()

   transaction_id  accountNumber  ...  cardPresent  expirationDateKeyInMatch
0         5533441      733493772  ...        False                     False
1         5533442      733493772  ...        False                     False
2         5533443      733493772  ...        False                     False
3         5533444      733493772  ...        False                     False
4         5533445      733493772  ...        False                     False

[5 rows x 24 columns]

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 24 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  currentBalance            641794 non-null  float64
 22  cardPresent               641914 non-null  bool
 23  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(5), int64(7), object(9)
memory usage: 104.7+ MB

# Pivoting

In [ ]:
data = data[data['transactionType']=='PURCHASE']
pd.pivot_table(data,index = ['merchantCategoryCode','merchantCountryCode'],values = 'transactionAmount',aggfunc = 'mean').head(11)

                                          transactionAmount
merchantCategoryCode merchantCountryCode
airline              CAN                         120.453043
                     MEX                         178.147949
                     PR                          136.571667
                     US                          148.552881
auto                 CAN                         143.973704
                     MEX                         172.448085
                     PR                          205.022105
                     US                          149.902006
cable/phone          CAN                         140.793750
                     MEX                         102.668462
                     US                           98.246807

# Crosstab

In [ ]:
pd.crosstab(data.merchantCategoryCode, data.posEntryMode, margins=True)

posEntryMode             2.0     5.0     9.0   80.0   90.0     All
merchantCategoryCode
airline                 2317    3733    2854    195    248    9347
auto                    2403    3828    2868    179    238    9516
cable/phone              298     561     536     19     45    1459
entertainment          16436   26023   19391   1338   1664   64852
fastfood               23807   38318   28639   1890   2366   95020
food                   16142   25645   19357   1326   1601   64071
food_delivery           1365    1902    1571      0     98    4936
fuel                    5483    8822    7009    449    660   22423
furniture               1802    3013    2195    161    189    7360
gym                      869    1103     691     38    173    2874
health                  3284    5542    4015    271    353   13465
hotels                  5334    8613    6472    429    551   21399
mobileapps              3694    5839    4344    290    353   14520
online_gifts            7837   12294    9413    641    788   30973
online_retail          38070   60489   46097   3117   3810  151583
online_subscriptions    2969    4398    3338    221    235   11161
personal care           3998    6387    4693    317    439   15834
rideshare              11845   19067   14381    966   1199   47458
subscriptions           4430    6779    5262    369    410   17250
All                   152383  242356  183126  12216  15420  605501

# Binning

In [ ]:
data = pd.read_csv('transactions1.csv',low_memory = False)
data['transactionAmount'] = pd.to_numeric(data['transactionAmount'],errors='coerce')
data['availableMoney'] = pd.to_numeric(data['availableMoney'],errors='coerce')
data['currentBalance'] = pd.to_numeric(data['currentBalance'],errors='coerce')
data.head()

   transaction_id  accountNumber  ...  cardPresent  expirationDateKeyInMatch
0         5533441      733493772  ...        False                     False
1         5533442      733493772  ...        False                     False
2         5533443      733493772  ...        False                     False
3         5533444      733493772  ...        False                     False
4         5533445      733493772  ...        False                     False

[5 rows x 24 columns]

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 24 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  currentBalance            641794 non-null  float64
 22  cardPresent               641914 non-null  bool
 23  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(5), int64(7), object(9)
memory usage: 104.7+ MB

In [ ]:
data.describe()

       transaction_id  accountNumber  ...  cardLast4Digits  currentBalance
count    6.419140e+05   6.419140e+05  ...    641914.000000   641794.000000
mean     5.854398e+06   5.547701e+08  ...      4886.184043     4045.137565
std      1.853048e+05   2.546884e+08  ...      2859.053679     5945.809259
min      5.533441e+06   1.005471e+08  ...         0.000000        0.000000
25%      5.693919e+06   3.223192e+08  ...      2364.000000      503.190000
50%      5.854398e+06   5.438879e+08  ...      4873.000000     2152.635000
75%      6.014876e+06   7.862277e+08  ...      7267.000000     5006.760000
max      6.175354e+06   9.999853e+08  ...      9998.000000    47496.500000

[8 rows x 12 columns]

In [ ]:
bins = [0, 250, 500, 750, 1000, 2000]
labels =['very low','low','moderate','high spending','very-high']
data['transactionLevel'] = pd.cut(data['transactionAmount'], bins,labels=labels)
data[['transactionAmount','transactionLevel']].head(8)

   transactionAmount transactionLevel
0             111.33         very low
1              24.75         very low
2             187.40         very low
3             227.34         very low
4               0.00              NaN
5               9.80         very low
6             247.99         very low
7               0.00              NaN

In [ ]:
data[data['transactionLevel']== 'moderate']['transactionAmount'].head()

80     665.84
84     665.21
85     665.84
173    539.21
258    506.52
Name: transactionAmount, dtype: float64

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 25 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  currentBalance            641794 non-null  float64
 22  cardPresent               641914 non-null  bool
 23  expirationDateKeyInMatch  641914 non-null  bool
 24  transactionLevel          621619 non-null  category
dtypes: bool(3), category(1), float64(5), int64(7), object(9)
memory usage: 105.3+ MB

# Categorical Encoding (Nominal Data)

In [ ]:
data = pd.read_csv('transactions1.csv',low_memory = False)
data['transactionAmount'] = pd.to_numeric(data['transactionAmount'],errors='coerce')
data['availableMoney'] = pd.to_numeric(data['availableMoney'],errors='coerce')
data['currentBalance'] = pd.to_numeric(data['currentBalance'],errors='coerce')
data.head()

   transaction_id  accountNumber  ...  cardPresent  expirationDateKeyInMatch
0         5533441      733493772  ...        False                     False
1         5533442      733493772  ...        False                     False
2         5533443      733493772  ...        False                     False
3         5533444      733493772  ...        False                     False
4         5533445      733493772  ...        False                     False

[5 rows x 24 columns]

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 24 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   transaction_id            641914 non-null  int64
 1   accountNumber             641914 non-null  int64
 2   customerId                641914 non-null  int64
 3   creditLimit               641914 non-null  int64
 4   availableMoney            641635 non-null  float64
 5   transactionDateTime       641914 non-null  object
 6   transactionAmount         640098 non-null  float64
 7   merchantName              641914 non-null  object
 8   acqCountry                638001 non-null  object
 9   merchantCountryCode       641290 non-null  object
 10  posEntryMode              638569 non-null  float64
 11  posConditionCode          641627 non-null  float64
 12  merchantCategoryCode      641914 non-null  object
 13  currentExpDate            641914 non-null  object
 14  accountOpenDate           641914 non-null  object
 15  dateOfLastAddressChange   641914 non-null  object
 16  cardCVV                   641914 non-null  int64
 17  enteredCVV                641914 non-null  int64
 18  cardLast4Digits           641914 non-null  int64
 19  transactionType           641325 non-null  object
 20  isFraud                   641914 non-null  bool
 21  currentBalance            641794 non-null  float64
 22  cardPresent               641914 non-null  bool
 23  expirationDateKeyInMatch  641914 non-null  bool
dtypes: bool(3), float64(5), int64(7), object(9)
memory usage: 104.7+ MB

In [ ]:

data = data[['transaction_id','transactionType']]

In [ ]:
data.head()

   transaction_id       transactionType
0         5533441              PURCHASE
1         5533442              PURCHASE
2         5533443              PURCHASE
3         5533444              PURCHASE
4         5533445  ADDRESS_VERIFICATION

In [ ]:
df = pd.get_dummies(data, columns=['transactionType'])

In [ ]:
df.head(8)

   transaction_id  ...  transactionType_REVERSAL
0         5533441  ...                         0
1         5533442  ...                         0
2         5533443  ...                         0
3         5533444  ...                         0
4         5533445  ...                         0
5         5533446  ...                         0
6         5533447  ...                         0
7         5533448  ...                         0

[8 rows x 4 columns]

# Categorical Data (Ordinal Data)

In [ ]:
data = pd.read_csv('transactions1.csv',low_memory = False)
data['transactionAmount'] = pd.to_numeric(data['transactionAmount'],errors='coerce')
data['availableMoney'] = pd.to_numeric(data['availableMoney'],errors='coerce')
data['currentBalance'] = pd.to_numeric(data['currentBalance'],errors='coerce')
data.head()

   transaction_id  accountNumber  ...  cardPresent  expirationDateKeyInMatch
0         5533441      733493772  ...        False                     False
1         5533442      733493772  ...        False                     False
2         5533443      733493772  ...        False                     False
3         5533444      733493772  ...        False                     False
4         5533445      733493772  ...        False                     False

[5 rows x 24 columns]

In [ ]:
bins = [0, 250, 500, 750, 1000, 2000]
labels =['very low','low','moderate','high spending','very-high']
data['transactionLevel'] = pd.cut(data['transactionAmount'], bins,labels=labels)
data[['transactionAmount','transactionLevel']].head(8)

   transactionAmount transactionLevel
0             111.33         very low
1              24.75         very low
2             187.40         very low
3             227.34         very low
4               0.00              NaN
5               9.80         very low
6             247.99         very low
7               0.00              NaN

In [ ]:
data = data[['transaction_id','accountNumber','customerId','transactionAmount']]

In [ ]:
data.head()

   transaction_id  accountNumber  customerId  transactionAmount
0         5533441      733493772   733493772             111.33
1         5533442      733493772   733493772              24.75
2         5533443      733493772   733493772             187.40
3         5533444      733493772   733493772             227.34
4         5533445      733493772   733493772               0.00

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641914 entries, 0 to 641913
Data columns (total 4 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   transaction_id     641914 non-null  int64
 1   accountNumber      641914 non-null  int64
 2   customerId         641914 non-null  int64
 3   transactionAmount  640098 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 19.6 MB

In [ ]:
bins = [0, 250, 500, 750, 1000, 2000]
labels =['very low','low','moderate','high spending','very-high']
data['transactionLevel'] = pd.cut(data['transactionAmount'], bins,labels=labels)
data.head()

   transaction_id  accountNumber  ...  transactionAmount  transactionLevel
0         5533441      733493772  ...             111.33          very low
1         5533442      733493772  ...              24.75          very low
2         5533443      733493772  ...             187.40          very low
3         5533444      733493772  ...             227.34          very low
4         5533445      733493772  ...               0.00               NaN

[5 rows x 5 columns]

In [ ]:
data['transactionLevel'].mode()[0]

'very low'

In [ ]:
data.transactionLevel.fillna(data['transactionLevel'].mode()[0],inplace = True)

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data["transactionLevelchanged"] = le.fit_transform(data["transactionLevel"])
data.head(7)

   transaction_id  accountNumber  ...  transactionLevel  transactionLevelchanged
0         5533441      733493772  ...          very low                        3
1         5533442      733493772  ...          very low                        3
2         5533443      733493772  ...          very low                        3
3         5533444      733493772  ...          very low                        3
4         5533445      733493772  ...          very low                        3
5         5533446      733493772  ...          very low                        3
6         5533447      733493772  ...          very low                        3

[7 rows x 6 columns]

In [ ]:
data["transactionLevelnew"] = data['transactionLevel'].map({'very low':0,'low':1,'moderate':2,'high spending':3,'very-high':4})
data.head()

   transaction_id  accountNumber  ...  transactionLevelchanged  transactionLevelnew
0         5533441      733493772  ...                        3                    0
1         5533442      733493772  ...                        3                    0
2         5533443      733493772  ...                        3                    0
3         5533444      733493772  ...                        3                    0
4         5533445      733493772  ...                        3                    0

[5 rows x 7 columns]